#################################### vCenter ###################################################
################################################################################################

[vCenter]

#部署环境用到的VC的IP
VCIP=10.117.169.99

#登陆VC的用户名
VCUsername=root

#登陆VC的密码
VCPassword=vmware

#要将vm部署到哪-个datastore之上，DatastoreName 即为datastore的名字. 
DatastoreName = datastore1

#部署VM用到的host对应的网关
Getway = 10.117.171.253

#确定所要部署的资源池的ID,以此来确定所要部署VM的路径.
moref = vim.ResourcePool:resgroup-428

#################################### Deploy Info ##################################################
###################################################################################################

[DeployINfo]

#部署VCAC时所指定的静态IP
VCACIP = 10.117.168.214

#部署VCAC时,与静态IP所对应的主机名字.(静态IP与主机名需要事先去域控中进行关联)
VCACHostName = vcac

#部署时，用到的VCAC build名字
VCACOVFName=VMware-vCAC-Appliance-6.1.0.0-2077124_OVF10.ova

#域控制器的名字
DomainName=dm.local

#部署SSO时所指定的静态IP
SSOIP = 10.117.168.215

#部署SSO时,与静态IP所对应的主机名字.(静态IP与主机名需要事先去域控中进行关联)
SSOHostName = sso

#部署时，用到的SSO build名字
SSOOVFName=VMware-Identity-Appliance-2.1.0.0-2007605_OVF10.ova


[Path]

#VCAC+SSO的build所在的路径映射成本地磁盘的盘符名称.(当前是将build所在的路径映射到本机的Y盘之上)
BuildPath=y:


#################################### V C A C  #####################################################
###################################################################################################

[VCAC]
#静默安装VCAC时用到的命令行参数，需要事先配置的参数是：（SSO同VCAC）
#--name=VCAC							部署VCAC虚机的名字
#--prop:varoot-password=vmware123				VCAC虚机的登陆密码
#--prop:vami.DNS.VMware_vCAC_Appliance=172.16.24.24		域控的IP
#prop:vami.netmask0.VMware_vCAC_Appliance=255.255.254.0 	域控的网关

VCACParam=-dm=thin --acceptAllEulas  --powerOn -nw="VM Network"  --name=VCAC61  --prop:varoot-password=@WSX3edc     --prop:vami.DNS.VMware_vCAC_Appliance=10.117.168.213  --prop:vami.netmask0.VMware_vCAC_Appliance=255.255.252.0     --prop:vami.gateway.VMware_vCAC_Appliance= 


#################################### S S O #######################################################
##################################################################################################

[SSO]
SSOParam=-dm=thin --acceptAllEulas --powerOn  --name=SSO61 -nw="VM Network" --prop:varoot-password=@WSX3edc   --prop:va-ssh-enabled=True  --prop:vami.DNS.VMware_Identity_Appliance=10.117.168.213  --prop:vami.netmask0.VMware_Identity_Appliance=255.255.252.0   --prop:vami.gateway.VMware_Identity_Appliance=


#################################### Open Browser ##################################################
####################################################################################################

[UI]
#配置VCAC：5480->VCAC Setting->SSL页面时填写的信息
Organisation=ORG
OrganisationalUnit=OU
CountryCode=US


#VCAC指定的license key
Licensing=500VH-D524J-K82P0-01320-2W73L


#创建租赁代理的信息
TenantName=表ポあA中Œé鷗停B逍Üßàùªñ하십니까
TenantDescription=表ポあA中Œé鷗停B逍Üßàùªñ하십니까
TenantURLName=vacatest
TenantContactEmail=mfang@vmware.com


#配置租赁代理ldap的配置信息
IdentityStoreName = 表ポあA中Œé鷗停B逍Üßàùªñ하십니까
IdentityStoreURL = ldap://10.117.168.213:389
IdentityStoreDomain = dm.local
IdentityStoreLoginUserDN = cn=administrator,cn=users,dc=dm,dc=local
IdentityStorePassword=ca$hc0w
IdentityStoreGroupSearchBaseDN = dc=dm,dc=local


#注册代理用户的信息
AdministratorsUserName1=adminlx2



#################################### Map NetworkPath ##############################################
###################################################################################################

[Map NetworkPath]

#VCAC和SSO build所存放的路径
ReallyBuildPath=\\10.117.170.221\build

#存放build的机器的用户名
UserName=share

#存放build的机器的密码
Password=share


####################################  Iaas Install  ###############################################
###################################################################################################

[Iaas]

#定义 IaaS 的安装方式，如果选择全部安装，值为 No，如果选择自定义安装，值为 Yes
CustomInstall=No

#当前登陆Iaas主机用的域用户密码
loginUserPassword=ca$hc0w

#DEM 服务名称
DEMWorkerName=DEM-鷗Œé停B逍Üßàù

#DEO 服务名称
DEMOrchestratorName=DEO-鷗Œé停B逍Üßàù

#vSphereAgent名称
VsphereAgentName=vSphereAgent

#端点名称
EndpointName=vCenter

#部署后VCAC对应服务的名字
ServiceName=VMware vCloud Automation Center Service

###################自定义安装的变量###################
#自定义路径
CustomInstallFolderName=CustomInstallFolderName

#数据库名称
DatabaseName=DatabaseName

#Web site 名称
WebSiteName=Default Web Site

#Iaas 中选择文件夹对话框中“计算机”节点和“c盘”节点的位置， TW（3，2），KR（2，8）
FolderOrder1=3
FolderOrder2=2

#数据库实例，格式为 SQLServerFQDN\SQLServerInstanceName，可以保留为空，表示使用Iaas server 本机的缺省实例。
DatabaseInstanceName= 